In [71]:
import sqlite3 as sql
import os
import pandas as pd

In [72]:
pd.options.display.max_rows = 1000
pd.options.display.width = 0
df  = pd.read_excel("data/fy2021cobbook9.xls", engine="xlrd",header=0,nrows=73)

In [73]:
df.iloc[2,0].replace("Region/Country: ","")
df["Region/Country"] = df.iloc[2,0].replace("Region/Country: ","")
df.columns = df.iloc[4]
df = df.rename(columns={df.iloc[1][-1]:"Region/Country"})
df = df.iloc[7:]
df = df.drop(columns="Total")

In [74]:
age = df.iloc[3:12]
age =age.iloc[1:]
age = age.rename(columns={"Characteristic":"Age"})
age = age.melt(id_vars=["Age"],value_vars=["Female","Male","Unknown"],var_name="Sex",value_name="Count")

In [75]:
marital = df.iloc[14:18]
marital = marital.melt(id_vars=["Characteristic"],value_vars=["Female","Male","Unknown"],var_name="Sex",value_name="Count")
marital = marital.rename(columns={"Characteristic":"Marital_status"})

In [76]:
occupations = df.iloc[20:33]
occupations = occupations.rename(columns={"Characteristic":"Occupations"})
occupations = occupations.melt(id_vars=["Occupations"],value_vars=["Female","Male","Unknown"],var_name="Sex",value_name="Count")

In [77]:
admission_class = df.iloc[35:41]
admission_class = admission_class.rename(columns={"Characteristic":"admission_class"})
admission_class = admission_class.melt(id_vars=["admission_class"],value_vars=["Female","Male","Unknown"],var_name="Sex",value_name="Count")

In [78]:
states = df.iloc[43:65]
states = states.rename(columns={"Characteristic":"States"})
states = states.melt(id_vars=["States"],value_vars=["Female","Male","Unknown"],var_name="Sex",value_name="Count")

In [79]:
display(
    age.head(3),
    marital.head(3),
    occupations.head(3),
    admission_class.head(3),
    states.head(3))

              Age     Sex Count
0  Under 18 years  Female   297
1  18 to 24 years  Female   170
2  25 to 34 years  Female   649

  Marital_status     Sex Count
0        Married  Female  1303
1         Single  Female   523
2          Other  Female    61

                                         Occupations     Sex Count
0  Management, professional, and related occupations  Female   437
1                                Service occupations  Female    70
2                       Sales and office occupations  Female   147

                        admission_class     Sex Count
0  Immediate relatives of U.S. citizens  Female  1080
1          Family-sponsored preferences  Female     D
2          Employment-based preferences  Female   532

       States     Sex Count
0     Arizona  Female    41
1  California  Female   573
2    Colorado  Female    53

In [80]:
directory = "data"

In [81]:
file_lists = []

In [82]:
for filename in os.listdir(directory):
    f = os.path.join(directory, filename)
    if os.path.isfile(f):
        file_lists.append(f)

In [83]:
age_list = []
marital_list = []
occupations_list = []
admissions_list = []
states_list = []

In [84]:
for i in file_lists:
    df = (pd.read_excel(i,engine="xlrd",header=0,nrows=73))
    df.iloc[2,0].replace("Region/Country: ","")
    df["Region/Country"] = df.iloc[2,0].replace("Region/Country: ","")
    df.columns = df.iloc[4]
    df = df.rename(columns={df.iloc[1][-1]:"Region/Country"})
    df = df.iloc[7:]
    df = df.drop(columns="Total")
    age = df.iloc[3:12]
    age =age.iloc[1:]
    age = age.rename(columns={"Characteristic":"Age"})
    age = age.melt(id_vars=["Age"],value_vars=["Female","Male","Unknown"],var_name="Sex",value_name="Count")
    marital = df.iloc[14:18]
    marital = marital.melt(id_vars=["Characteristic"],value_vars=["Female","Male","Unknown"],var_name="Sex",value_name="Count")
    marital = marital.rename(columns={"Characteristic":"Marital_status"})
    occupations = df.iloc[20:33]
    occupations = occupations.rename(columns={"Characteristic":"Occupations"})
    occupations = occupations.melt(id_vars=["Occupations"],value_vars=["Female","Male","Unknown"],var_name="Sex",value_name="Count")    
    admission_class = df.iloc[35:41]
    admission_class = admission_class.rename(columns={"Characteristic":"admission_class"})
    admission_class = admission_class.melt(id_vars=["admission_class"],value_vars=["Female","Male","Unknown"],var_name="Sex",value_name="Count")
    states = df.iloc[43:65]
    states = states.rename(columns={"Characteristic":"States"})
    states = states.melt(id_vars=["States"],value_vars=["Female","Male","Unknown"],var_name="Sex",value_name="Count")
    age_list.append(age)
    marital_list.append(marital)
    occupations_list.append(occupations)
    admissions_list.append(admission_class)
    states_list.append(states)

In [85]:
age = pd.concat(age_list)
marital = pd.concat(marital_list)
occupations = pd.concat(occupations_list)
admission = pd.concat(admissions_list)
states = pd.concat(states_list)

In [86]:
display(
    age.head(3),
    marital.head(3),
    occupations.head(3),
    admission.head(3),
    states.head(3))

              Age     Sex Count
0  Under 18 years  Female     4
1  18 to 24 years  Female     D
2  25 to 34 years  Female    15

  Marital_status     Sex Count
0        Married  Female     D
1         Single  Female    11
2          Other  Female     D

                                         Occupations     Sex Count
0  Management, professional, and related occupations  Female     D
1                                Service occupations  Female     5
2                       Sales and office occupations  Female     D

                        admission_class     Sex Count
0  Immediate relatives of U.S. citizens  Female    28
1          Family-sponsored preferences  Female     D
2          Employment-based preferences  Female     D

        States     Sex Count
0   California  Female     D
1  Connecticut  Female     3
2      Florida  Female     D